In [2]:
import numpy as np
import pandas as pd

In [3]:
titanic_df = pd.read_csv(r"C:\Users\faiza\Documents\Python-Learning\Python_Notes\Datasets\titanic.csv")

In [4]:
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic_df.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [6]:
titanic_df.sex.value_counts()/len(titanic_df) *100

sex
male      64.758698
female    35.241302
Name: count, dtype: float64

DATA CLEANING AND FILTERING

In [7]:
titanic_df.drop(columns = [ "survived", "pclass","sibsp", "embarked", "who","deck","parch", "adult_male","alone"], inplace = True)

In [8]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sex          891 non-null    object
 1   age          714 non-null    float64
 2   fare         891 non-null    float64
 3   class        891 non-null    object
 4   embark_town  889 non-null    object
 5   alive        891 non-null    object
dtypes: float64(2), object(4)
memory usage: 41.9+ KB

In [9]:
titanic_df.head()

      sex   age     fare  class  embark_town alive
0    male  22.0   7.2500  Third  Southampton    no
1  female  38.0  71.2833  First    Cherbourg   yes
2  female  26.0   7.9250  Third  Southampton   yes
3  female  35.0  53.1000  First  Southampton   yes
4    male  35.0   8.0500  Third  Southampton    no

In [10]:
# to find missing values

titanic_df.isna().sum()

sex              0
age            177
fare             0
class            0
embark_town      2
alive            0
dtype: int64

In [11]:
titanic_df.age.mean()

np.float64(29.69911764705882)

In [12]:
# another method to insert mean value direct with the fillna()

titanic_df['age'].fillna(titanic_df['age'].mean(), inplace = True)

In [13]:
titanic_df.embark_town.value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [14]:
print(titanic_df.to_string())

        sex        age      fare   class  embark_town alive
0      male  22.000000    7.2500   Third  Southampton    no
1    female  38.000000   71.2833   First    Cherbourg   yes
2    female  26.000000    7.9250   Third  Southampton   yes
3    female  35.000000   53.1000   First  Southampton   yes
4      male  35.000000    8.0500   Third  Southampton    no
5      male  29.699118    8.4583   Third   Queenstown    no
6      male  54.000000   51.8625   First  Southampton    no
7      male   2.000000   21.0750   Third  Southampton    no
8    female  27.000000   11.1333   Third  Southampton   yes
9    female  14.000000   30.0708  Second    Cherbourg   yes
10   female   4.000000   16.7000   Third  Southampton   yes
11   female  58.000000   26.5500   First  Southampton   yes
12     male  20.000000    8.0500   Third  Southampton    no
13     male  39.000000   31.2750   Third  Southampton    no
14   female  14.000000    7.8542   Third  Southampton    no
15   female  55.000000   16.0000  Second  Southampton   yes
16     male   2.000000   29.1250   Third   Queenstown    no
17     male  29.699118   13.0000  Second  Southampton   yes
18   female  31.000000   18.0000   Third  Southampton    no
19   female  29.699118    7.2250   Third    Cherbourg   yes
20     male  35.000000   26.0000  Second  Southampton    no
21     male  34.000000   13.0000  Second  Southampton   yes
22   female  15.000000    8.0292   Third   Queenstown   yes
23     male  28.000000   35.5000   First  Southampton   yes
24   female   8.000000   21.0750   Third  Southampton    no
25   female  38.000000   31.3875   Third  Southampton   yes
26     male  29.699118    7.2250   Third    Cherbourg    no
27     male  19.000000  263.0000   First  Southampton    no
28   female  29.699118    7.8792   Third   Queenstown   yes
29     male  29.699118    7.8958   Third  Southampton    no
30     male  40.000000   27.7208   First    Cherbourg    no
31   female  29.699118  146.5208   First    Cherbourg   yes
32   female  29.699118    7.7500   Third   Queenstown   yes
33     male  66.000000   10.5000  Second  Southampton    no
34     male  28.000000   82.1708   First    Cherbourg    no
35     male  42.000000   52.0000   First  Southampton    no
36     male  29.699118    7.2292   Third    Cherbourg   yes
37     male  21.000000    8.0500   Third  Southampton    no
38   female  18.000000   18.0000   Third  Southampton    no
39   female  14.000000   11.2417   Third    Cherbourg   yes
40   female  40.000000    9.4750   Third  Southampton    no
41   female  27.000000   21.0000  Second  Southampton    no
42     male  29.699118    7.8958   Third    Cherbourg    no
43   female   3.000000   41.5792  Second    Cherbourg   yes
44   female  19.000000    7.8792   Third   Queenstown   yes
45     male  29.699118    8.0500   Third  Southampton    no
46     male  29.699118   15.5000   Third   Queenstown    no
47   female  29.699118    7.7500   Third   Queenstown   yes
48     male  29.699118   21.6792   Third    Cherbourg    no
49   female  18.000000   17.8000   Third  Southampton    no
50     male   7.000000   39.6875   Third  Southampton    no
51     male  21.000000    7.8000   Third  Southampton    no
52   female  49.000000   76.7292   First    Cherbourg   yes
53   female  29.000000   26.0000  Second  Southampton   yes
54     male  65.000000   61.9792   First    Cherbourg    no
55     male  29.699118   35.5000   First  Southampton   yes
56   female  21.000000   10.5000  Second  Southampton   yes
57     male  28.500000    7.2292   Third    Cherbourg    no
58   female   5.000000   27.7500  Second  Southampton   yes
59     male  11.000000   46.9000   Third  Southampton    no
60     male  22.000000    7.2292   Third    Cherbourg    no
61   female  38.000000   80.0000   First          NaN   yes
62     male  45.000000   83.4750   First  Southampton    no
63     male   4.000000   27.9000   Third  Southampton    no
64     male  29.699118   27.7208   First    Cherbourg    no
65     male  29.699118   15.2458   Third    Cherbourg   yes
66   female  29.000000   10.5000  Second  Southampton   yes
67     male  19.000000    8.1583   Third  Southampton    no
68   female  17.000000    7.9250   Third  Southampton   yes
69     male  26.000000    8.6625   Third  Southampton    no
70     male  32.000000   10.5000  Second  Southampton    no
71   female  16.000000   46.9000   Third  Southampton    no
72     male  21.000000   73.5000  Second  Southampton    no
73     male  26.000000   14.4542   Third    Cherbourg    no
74     male  32.000000   56.4958   Third  Southampton   yes
75     male  25.000000    7.6500   Third  Southampton    no
76     male  29.699118    7.8958   Third  Southampton    no
77     male  29.699118    8.0500   Third  Southampton    no
78     male   0.830000   29.0000  Second  Southampton   yes
79   female  30.000000   12.4750   Third  Southampton   yes
80     male  22.000000    9.0000   Third  Southampton    no
81     male  29.000000    9.5000   Third  Southampton   yes
82   female  29.699118    7.7875   Third   Queenstown   yes
83     male  28.000000   47.1000   First  Southampton    no
84   female  17.000000   10.5000  Second  Southampton   yes
85   female  33.000000   15.8500   Third  Southampton   yes
86     male  16.000000   34.3750   Third  Southampton    no
87     male  29.699118    8.0500   Third  Southampton    no
88   female  23.000000  263.0000   First  Southampton   yes
89     male  24.000000    8.0500   Third  Southampton    no
90     male  29.000000    8.0500   Third  Southampton    no
91     male  20.000000    7.8542   Third  Southampton    no
92     male  46.000000   61.1750   First  Southampton    no
93     male  26.000000   20.5750   Third  Southampton    no
94     male  59.000000    7.2500   Third  Southampton    no
95     male  29.699118    8.0500   Third  Southampton    no
96     male  71.000000   34.6542   First    Cherbourg    no
97     male  23.000000   63.3583   First    Cherbourg   yes
98   female  34.000000   23.0000  Second  Southampton   yes
99     male  34.000000   26.0000  Second  Southampton    no
100  female  28.000000    7.8958   Third  Southampton    no
101    male  29.699118    7.8958   Third  Southampton    no
102    male  21.000000   77.2875   First  Southampton    no
103    male  33.000000    8.6542   Third  Southampton    no
104    male  37.000000    7.9250   Third  Southampton    no
105    male  28.000000    7.8958   Third  Southampton    no
106  female  21.000000    7.6500   Third  Southampton   yes
107    male  29.699118    7.7750   Third  Southampton   yes
108    male  38.000000    7.8958   Third  Southampton    no
109  female  29.699118   24.1500   Third   Queenstown   yes
110    male  47.000000   52.0000   First  Southampton    no
111  female  14.500000   14.4542   Third    Cherbourg    no
112    male  22.000000    8.0500   Third  Southampton    no
113  female  20.000000    9.8250   Third  Southampton    no
114  female  17.000000   14.4583   Third    Cherbourg    no
115    male  21.000000    7.9250   Third  Southampton    no
116    male  70.500000    7.7500   Third   Queenstown    no
117    male  29.000000   21.0000  Second  Southampton    no
118    male  24.000000  247.5208   First    Cherbourg    no
119  female   2.000000   31.2750   Third  Southampton    no
120    male  21.000000   73.5000  Second  Southampton    no
121    male  29.699118    8.0500   Third  Southampton    no
122    male  32.500000   30.0708  Second    Cherbourg    no
123  female  32.500000   13.0000  Second  Southampton   yes
124    male  54.000000   77.2875   First  Southampton    no
125    male  12.000000   11.2417   Third    Cherbourg   yes
126    male  29.699118    7.7500   Third   Queenstown    no
127    male  24.000000    7.1417   Third  Southampton   yes
128  female  29.699118   22.3583   Third    Cherbourg   yes
129    male  45.000000    6.9750   Third  Southampton    no
130    male  33.000000    7.8958   Third    Cherbourg    no
131    male  20.000000    7.0500   Third  Southampton    no
132  female  47.000000   14.5000   Third  Southampton    no
133  female  29.000000   26.0000  Second  Southampton   yes
134    male  25.000000   13.0000  Second  Southampton    no
135    male  23.000000   15.0458  Second    Cherbourg    no
136  female  19.000000   26.2833   First  Southampton   yes
137    male  37.000000   53.1000   First  Southampton    no
138    male  16.000000    9.2167   Third  Southampton    no
139    male  24.000000   79.2000   First    Cherbourg    no
140  female  29.699118   15.2458   Third    Cherbourg    no
141  female  22.000000    7.7500   Third  Southampton   yes
142  female  24.000000   15.8500   Third  Southampton   yes
143    male  19.000000    6.7500   Third   Queenstown    no
144    male  18.000000   11.5000  Second  Southampton    no
145    male  19.000000   36.7500  Second  Southampton    no
146    male  27.000000    7.7958   Third  Southampton   yes
147  female   9.000000   34.3750   Third  Southampton    no
148    male  36.500000   26.0000  Second  Southampton    no
149    male  42.000000   13.0000  Second  Southampton    no
150    male  51.000000   12.5250  Second  Southampton    no
151  female  22.000000   66.6000   First  Southampton   yes
152    male  55.500000    8.0500   Third  Southampton    no
153    male  40.500000   14.5000   Third  Southampton    no
154    male  29.699118    7.3125   Third  Southampton    no
155    male  51.000000   61.3792   First    Cherbourg    no
156  female  16.000000    7.7333   Third   Queenstown   yes
157    male  30.000000    8.0500   Third  Southampton    no
158    male  29.699118    8.6625   Third  Southampton    no
159    male  29.699118   69.5500   Third  Southampton    no
160    male  44.000000   16.1000   Third  Southampton    no
161  female  40.000000   15.7500  Second  Southampton   yes
162    male  26.000000    7.7750   Third  Southampton    no
163    male  17.000000    8.6625   Third  Southampton    no
164    male   1.000000   39.6875   Third  Southampton    no
165    male   9.000000   20.5250   Third  Southampton   yes
166  female  29.699118   55.0000   First  Southampton   yes
167  female  45.000000   27.9000   Third  Southampton    no
168    male  29.699118   25.9250   First  Southampton    no
169    male  28.000000   56.4958   Third  Southampton    no
170    male  61.000000   33.5000   First  Southampton    no
171    male   4.000000   29.1250   Third   Queenstown    no
172  female   1.000000   11.1333   Third  Southampton   yes
173    male  21.000000    7.9250   Third  Southampton    no
174    male  56.000000   30.6958   First    Cherbourg    no
175    male  18.000000    7.8542   Third  Southampton    no
176    male  29.699118   25.4667   Third  Southampton    no
177  female  50.000000   28.7125   First    Cherbourg    no
178    male  30.000000   13.0000  Second  Southampton    no
179    male  36.000000    0.0000   Third  Southampton    no
180  female  29.699118   69.5500   Third  Southampton    no
181    male  29.699118   15.0500  Second    Cherbourg    no
182    male   9.000000   31.3875   Third  Southampton    no
183    male   1.000000   39.0000  Second  Southampton   yes
184  female   4.000000   22.0250   Third  Southampton   yes
185    male  29.699118   50.0000   First  Southampton    no
186  female  29.699118   15.5000   Third   Queenstown   yes
187    male  45.000000   26.5500   First  Southampton   yes
188    male  40.000000   15.5000   Third   Queenstown    no
189    male  36.000000    7.8958   Third  Southampton    no
190  female  32.000000   13.0000  Second  Southampton   yes
191    male  19.000000   13.0000  Second  Southampton    no
192  female  19.000000    7.8542   Third  Southampton   yes
193    male   3.000000   26.0000  Second  Southampton   yes
194  female  44.000000   27.7208   First    Cherbourg   yes
195  female  58.000000  146.5208   First    Cherbourg   yes
196    male  29.699118    7.7500   Third   Queenstown    no
197    male  42.000000    8.4042   Third  Southampton    no
198  female  29.699118    7.7500   Third   Queenstown   yes
199  female  24.000000   13.0000  Second  Southampton    no
200    male  28.000000    9.5000   Third  Southampton    no
201    male  29.699118   69.5500   Third  Southampton    no
202    male  34.000000    6.4958   Third  Southampton    no
203    male  45.500000    7.2250   Third    Cherbourg    no
204    male  18.000000    8.0500   Third  Southampton   yes
205  female   2.000000   10.4625   Third  Southampton    no
206    male  32.000000   15.8500   Third  Southampton    no
207    male  26.000000   18.7875   Third    Cherbourg   yes
208  female  16.000000    7.7500   Third   Queenstown   yes
209    male  40.000000   31.0000   First    Cherbourg   yes
210    male  24.000000    7.0500   Third  Southampton    no
211  female  35.000000   21.0000  Second  Southampton   yes
212    male  22.000000    7.2500   Third  Southampton    no
213    male  30.000000   13.0000  Second  Southampton    no
214    male  29.699118    7.7500   Third   Queenstown    no
215  female  31.000000  113.2750   First    Cherbourg   yes
216  female  27.000000    7.9250   Third  Southampton   yes
217    male  42.000000   27.0000  Second  Southampton    no
218  female  32.000000   76.2917   First    Cherbourg   yes
219    male  30.000000   10.5000  Second  Southampton    no
220    male  16.000000    8.0500   Third  Southampton   yes
221    male  27.000000   13.0000  Second  Southampton    no
222    male  51.000000    8.0500   Third  Southampton    no
223    male  29.699118    7.8958   Third  Southampton    no
224    male  38.000000   90.0000   First  Southampton   yes
225    male  22.000000    9.3500   Third  Southampton    no
226    male  19.000000   10.5000  Second  Southampton   yes
227    male  20.500000    7.2500   Third  Southampton    no
228    male  18.000000   13.0000  Second  Southampton    no
229  female  29.699118   25.4667   Third  Southampton    no
230  female  35.000000   83.4750   First  Southampton   yes
231    male  29.000000    7.7750   Third  Southampton    no
232    male  59.000000   13.5000  Second  Southampton    no
233  female   5.000000   31.3875   Third  Southampton   yes
234    male  24.000000   10.5000  Second  Southampton    no
235  female  29.699118    7.5500   Third  Southampton    no
236    male  44.000000   26.0000  Second  Southampton    no
237  female   8.000000   26.2500  Second  Southampton   yes
238    male  19.000000   10.5000  Second  Southampton    no
239    male  33.000000   12.2750  Second  Southampton    no
240  female  29.699118   14.4542   Third    Cherbourg    no
241  female  29.699118   15.5000   Third   Queenstown   yes
242    male  29.000000   10.5000  Second  Southampton    no
243    male  22.000000    7.1250   Third  Southampton    no
244    male  30.000000    7.2250   Third    Cherbourg    no
245    male  44.000000   90.0000   First   Queenstown    no
246  female  25.000000    7.7750   Third  Southampton    no
247  female  24.000000   14.5000  Second  Southampton   yes
248    male  37.000000   52.5542   First  Southampton   yes
249    male  54.000000   26.0000  Second  Southampton    no
250    male  29.699118    7.2500   Third  Southampton    no
251  female  29.000000   10.4625   Third  Southampton    no
252    male  62.000000   26.5500   First  Southampton    no
253    male  30.000000   16.1000   Third  Southampton    no
254  female  41.000000   20.2125   Third  Southampton    no
255  female  29.000000   15.2458   Third    Cherbourg   yes
256  female  29.699118   79.2000   First    Cherbourg   yes
257  female  30.000000   86.5000   First  Southampton   yes
258  female  35.000000  512.3292   First    Cherbourg   yes
259  female  50.000000   26.0000  Second  Southampton   yes
260    male  29.699118    7.7500   Third   Queenstown    no
261    male   3.000000   31.3875   Third  Southampton   yes
262    male  52.000000   79.6500   First  Southampton    no
263    male  40.000000    0.0000   First  Southampton    no
264  female  29.699118    7.7500   Third   Queenstown    no
265    male  36.000000   10.5000  Second  Southampton    no
266    male  16.000000   39.6875   Third  Southampton    no
267    male  25.000000    7.7750   Third  Southampton   yes
268  female  58.000000  153.4625   First  Southampton   yes
269  female  35.000000  135.6333   First  Southampton   yes
270    male  29.699118   31.0000   First  Southampton    no
271    male  25.000000    0.0000   Third  Southampton   yes
272  female  41.000000   19.5000  Second  Southampton   yes
273    male  37.000000   29.7000   First    Cherbourg    no
274  female  29.699118    7.7500   Third   Queenstown   yes
275  female  63.000000   77.9583   First  Southampton   yes
276  female  45.000000    7.7500   Third  Southampton    no
277    male  29.699118    0.0000  Second  Southampton    no
278    male   7.000000   29.1250   Third   Queenstown    no
279  female  35.000000   20.2500   Third  Southampton   yes
280    male  65.000000    7.7500   Third   Queenstown    no
281    male  28.000000    7.8542   Third  Southampton    no
282    male  16.000000    9.5000   Third  Southampton    no
283    male  19.000000    8.0500   Third  Southampton   yes
284    male  29.699118   26.0000   First  Southampton    no
285    male  33.000000    8.6625   Third    Cherbourg    no
286    male  30.000000    9.5000   Third  Southampton   yes
287    male  22.000000    7.8958   Third  Southampton    no
288    male  42.000000   13.0000  Second  Southampton   yes
289  female  22.000000    7.7500   Third   Queenstown   yes
290  female  26.000000   78.8500   First  Southampton   yes
291  female  19.000000   91.0792   First    Cherbourg   yes
292    male  36.000000   12.8750  Second    Cherbourg    no
293  female  24.000000    8.8500   Third  Southampton    no
294    male  24.000000    7.8958   Third  Southampton    no
295    male  29.699118   27.7208   First    Cherbourg    no
296    male  23.500000    7.2292   Third    Cherbourg    no
297  female   2.000000  151.5500   First  Southampton    no
298    male  29.699118   30.5000   First  Southampton   yes
299  female  50.000000  247.5208   First    Cherbourg   yes
300  female  29.699118    7.7500   Third   Queenstown   yes
301    male  29.699118   23.2500   Third   Queenstown   yes
302    male  19.000000    0.0000   Third  Southampton    no
303  female  29.699118   12.3500  Second   Queenstown   yes
304    male  29.699118    8.0500   Third  Southampton    no
305    male   0.920000  151.5500   First  Southampton   yes
306  female  29.699118  110.8833   First    Cherbourg   yes
307  female  17.000000  108.9000   First    Cherbourg   yes
308    male  30.000000   24.0000  Second    Cherbourg    no
309  female  30.000000   56.9292   First    Cherbourg   yes
310  female  24.000000   83.1583   First    Cherbourg   yes
311  female  18.000000  262.3750   First    Cherbourg   yes
312  female  26.000000   26.0000  Second  Southampton    no
313    male  28.000000    7.8958   Third  Southampton    no
314    male  43.000000   26.2500  Second  Southampton    no
315  female  26.000000    7.8542   Third  Southampton   yes
316  female  24.000000   26.0000  Second  Southampton   yes
317    male  54.000000   14.0000  Second  Southampton    no
318  female  31.000000  164.8667   First  Southampton   yes
319  female  40.000000  134.5000   First    Cherbourg   yes
320    male  22.000000    7.2500   Third  Southampton    no
321    male  27.000000    7.8958   Third  Southampton    no
322  female  30.000000   12.3500  Second   Queenstown   yes
323  female  22.000000   29.0000  Second  Southampton   yes
324    male  29.699118   69.5500   Third  Southampton    no
325  female  36.000000  135.6333   First    Cherbourg   yes
326    male  61.000000    6.2375   Third  Southampton    no
327  female  36.000000   13.0000  Second  Southampton   yes
328  female  31.000000   20.5250   Third  Southampton   yes
329  female  16.000000   57.9792   First    Cherbourg   yes
330  female  29.699118   23.2500   Third   Queenstown   yes
331    male  45.500000   28.5000   First  Southampton    no

Example dataset of using dropna() and its properties

In [15]:
employee = { 
    "Name": ["Anil", "Sunil", np.nan, "John", np.nan],
    "Age" : [24, 23, np.nan, 32, 35],
    "Salary": [10000, 15000, np.nan, 25000, 30000]

}

In [16]:
df = pd.DataFrame(employee)
df

    Name   Age   Salary
0   Anil  24.0  10000.0
1  Sunil  23.0  15000.0
2    NaN   NaN      NaN
3   John  32.0  25000.0
4    NaN  35.0  30000.0

CONDITIONAL FILTERING

In [22]:
# give me the record of the employees whose salary was above 18k salary 
# STEP1
# we just made a condition
c1 = df['Salary'] >= 15000 

c1

0    False
1     True
2    False
3     True
4     True
Name: Salary, dtype: bool

In [23]:
# STEP2
# Now We put the condition inside the DataFrame
c1 = df[df['Salary'] >= 15000 ]
c1

    Name   Age   Salary
1  Sunil  23.0  15000.0
3   John  32.0  25000.0
4    NaN  35.0  30000.0

In [ ]:
# it will delete the full row which has nan value in each column

df.dropna(how = 'all')

    Name   Age   Salary
0   Anil  24.0  10000.0
1  Sunil  23.0  15000.0
3   John  32.0  25000.0
4    NaN  35.0  30000.0

In [18]:
df.dropna(thresh= 3) 
# it means we have to keep the row which has at least 3 cells with data

    Name   Age   Salary
0   Anil  24.0  10000.0
1  Sunil  23.0  15000.0
3   John  32.0  25000.0

In [28]:
titanic_df.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
# Q1: How can we find out that how many male and female were in Third class?

female_third_class = titanic_df[titanic_df['sex'] == 'female']
female_third_class

In [30]:
male_third_class = titanic_df[titanic_df['sex'] == 'male']
male_third_class

      sex        age     fare   class  embark_town alive
0    male  22.000000   7.2500   Third  Southampton    no
4    male  35.000000   8.0500   Third  Southampton    no
5    male  29.699118   8.4583   Third   Queenstown    no
6    male  54.000000  51.8625   First  Southampton    no
7    male   2.000000  21.0750   Third  Southampton    no
..    ...        ...      ...     ...          ...   ...
883  male  28.000000  10.5000  Second  Southampton    no
884  male  25.000000   7.0500   Third  Southampton    no
886  male  27.000000  13.0000  Second  Southampton    no
889  male  26.000000  30.0000   First    Cherbourg   yes
890  male  32.000000   7.7500   Third   Queenstown    no

[577 rows x 6 columns]

In [34]:
people_Third_class = titanic_df[titanic_df['class'] == 'Third']
people_Third_class

        sex        age     fare  class  embark_town alive
0      male  22.000000   7.2500  Third  Southampton    no
2    female  26.000000   7.9250  Third  Southampton   yes
4      male  35.000000   8.0500  Third  Southampton    no
5      male  29.699118   8.4583  Third   Queenstown    no
7      male   2.000000  21.0750  Third  Southampton    no
..      ...        ...      ...    ...          ...   ...
882  female  22.000000  10.5167  Third  Southampton    no
884    male  25.000000   7.0500  Third  Southampton    no
885  female  39.000000  29.1250  Third   Queenstown    no
888  female  29.699118  23.4500  Third  Southampton    no
890    male  32.000000   7.7500  Third   Queenstown    no

[491 rows x 6 columns]

In [35]:
people_Third_class['sex'].value_counts()

sex
male      347
female    144
Name: count, dtype: int64